Revit 2024 API
PathReinforcement.IsValidPrimaryBarOrientation Method
 Checks if orientation for primary bars is valid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsValidPrimaryBarOrientation(
	ReinforcementBarOrientation orientation
)
Visual Basic
Public Function IsValidPrimaryBarOrientation ( _
	orientation As ReinforcementBarOrientation _
) As Boolean
Visual C++
public:
bool IsValidPrimaryBarOrientation(
	ReinforcementBarOrientation orientation
)
Parameters
orientation
Type: Autodesk.Revit.DB.Structure.ReinforcementBarOrientation
 An orientation.
Return Value
 True if orientation for primary bars are valid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace